// news-data.js
const Details = [
  {
    id: "001",
    title: "月藍傳奇Remake絕無城DLC火熱製作中！",
    date: "2025/05/15",
    image: "pic/Title_BLR02.png",
    content: `
    各位有期待我們的絕無城DLC？現在正在加緊趕工中！
    在此放上製作中的進度資訊，跟大家報告我們正在努力製作中！
    這次的內容會讓那些讓具有鮮明特色的NPC角色作為關卡BOSS與大家見面，
    請大家再多等一下吧！`
  },
  {
    id: "002",
    title: "月藍傳奇Remake於Steam參與RM遊戲節，進行半價促銷。",
    date: "2025/05/17",
    image: "pic/Title_BLR10.png",
    content: `
    Steam正在進行RM遊戲節的促銷！
    在（5/20~5/27）之間，月藍傳奇Remake進行半價促銷！
    原價499元折扣後為249元，
    如果有想要入手的玩家們務必趕緊搶購，一起來體驗月藍傳奇故事的神秘魅力吧！`
  },
    {
    id: "003",
    title: "月藍傳奇Remake外傳－百草的願望，進行Steam上架審核中。",
    date: "2025/05/15",
    image: "pic/CG_UT_Birthday.png",
    content: `
      月藍傳奇Remake外傳正在進行上架審核的部分，
      上架後首周打折20%，預計售價為199元新台幣。
      期待與玩家們的見面。`
  },
    {
    id: "004",
    title: "期間限定，《謳歌的聖女》現在進行遊戲，即可獲得【世界樹的樹枝】。",
    date: "2025/05/15",
    image: "pic/stick.png",
    content: `
    親愛的玩家們，由於我們發現許多玩家因為未能獲得隱藏的【世界樹
    的樹枝】，導致無法觸發好結局而感到沮喪。

    我們為了讓玩家擁有更良好的遊戲體驗，於是從即日起（2025/05/12）為
    期一個禮拜的活動。

    只要活動期間遊玩《謳歌的聖女》，
    即可額外獲得一個【世界樹的樹枝】。
        `
  },
    {
    id: "005",
    title: "為了感謝玩家們的喜愛，《謳歌的聖女》將變更為免費遊戲。",
    date: "2025/05/15",
    image: "pic/Game03.png",
    content: `
      在《謳歌的聖女》這款遊戲上架後經過了兩年半的時間，期間受到了不少玩家的喜愛。

      為了擴大遊戲的影響力與能夠讓更多玩家能夠願意嘗試這款遊戲，自5/15起，於Steam平台上從付費遊戲變更為免費遊戲。

      希望喜歡的玩家們可以推薦給身邊的親朋好友，讓他們一同享受這款遊戲。
    `
  },
];